XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A33G52x_Series.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>ABOV</vendor>
  <name>A33G52x_Series</name>
  <description>ABOV Semiconductor A33G52x Series Device Support, Drivers and Examples</description>
  <url>http://www.abov.co.kr/data/mds/PACK/</url>
  <supportContact>abov_fae@abov.co.kr</supportContact>
  <releases>
    <release version="1.0.10" date="2020-12-01">
        - Removed Document directory
        - Removed Coocox projects and startup files (Compiler support Discontinued.)
        - Updated debug framework and uart driver
        - Polling or interrupt type debug channel support
        - Each Keil/IAR example are applied debug_frmwrk driver. (Tested)
        - Added Release Notes.txt file
        - Added UART example for using old version debug frame work.
        - SVD/SFR register fields that overlap with the offset address are separated for each function. (UART, SPI)
    </release>
  </releases>
  <keywords>
    <keyword>ABOV</keyword>
    <keyword>A33G52x</keyword>
    <keyword>A33G527</keyword>
    <keyword>A33G526</keyword>
    <keyword>A33G524</keyword>
    <keyword>General Purpose</keyword>
  </keywords>
  <devices>
    <family Dfamily="A33G52x Series" Dvendor="ABOV Semiconductor:126">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p0" Dfpu="0" Dmpu="0" Dendian="Little-endian" />
      <description>The ABOV A33G52x Series device family contains an ARM Cortex-M3 processor with a versatile set of on-chip peripherals.</description>
      <!-- Subfamily : A33G527 *********************************************************-->
      <subFamily DsubFamily="A33G52x">
        <processor Dclock="75000000" />
        <compile header="A33G52x\Core\include\A33G52x.h" />
        <debug svd="A33G52x\SVD\A33G52x.svd" />
        <feature type="VCC" n="3.00" m="5.50" />
        <feature type="Temp" n="-40" m="85" />
		<!-- use for all devices of the family  -->
        <memory id="IROM1" start="0x00000000" size="0x60000" startup="1" default="1" />
        <memory id="IRAM1" start="0x20000000" size="0x6000" init="0" default="1" />
        <feature type="WDT" n="1" m="32" name="Watchdog Timer" />
        <feature type="Other" n="1" m="32" name="FRT" />
        <feature type="Timer" n="10" m="16" name="Timer" />
        <feature type="PWM" n="8" m="16" name="PWM" />
        <feature type="I2C" n="2" name="I2C" />
        <feature type="UART" n="4" name="UART" />
        <feature type="SPI" n="2" name="SPI" />

        <!-- Device : A33G527 -->
        <device Dname="A33G527">
    	  <!-- finally, this is the default for the device -->
          <description>384KB Code Flash, Package type 100MQFP</description>
          <algorithm name="A33G52x\Flashloader\A33G527_Code_Flashloader.FLM" start="0x00000000" size="0x60000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x60000" startup="1" default="1" />
          <feature type="IOs" n="90" name="Inputs/Outputs" />
          <feature type="QFP" n="100" name="MQFP" />
		      <feature type="ADC" n="1" m="16" name="ADC" />
        </device>
        <!-- Device : A33G526 -->
        <device Dname="A33G526">
          <description>256KB Code Flash, Package type 64LQFP</description>
		    <!-- finally, this is the default for the device -->
          <algorithm name="A33G52x\Flashloader\A33G526_Code_Flashloader.FLM" start="0x00000000" size="0x40000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x40000" startup="1" default="1" />
          <feature type="IOs" n="60" name="Inputs/Outputs" />
          <feature type="QFP" n="64" name="LQFP" />
		      <feature type="ADC" n="1" m="10" name="ADC" />
        </device>
        <!-- Device : A33G526 -->
        <device Dname="A33G524">
	        <description>128KB Code Flash, Package type 64LQFP</description>
	      <!-- finally, this is the default for the device -->
          <algorithm name="A33G52x\Flashloader\A33G524_Code_Flashloader.FLM" start="0x00000000" size="0x20000" default="1" />
          <memory id="IROM1" start="0x00000000" size="0x20000" startup="1" default="1" />
          <feature type="IOs" n="60" name="Inputs/Outputs" />
          <feature type="QFP" n="64" name="LQFP" />
		      <feature type="ADC" n="1" m="10" name="ADC" />
        </device>
      </subFamily>
    </family>
  </devices>
  <conditions>
     <!-- condition : A33G526/527 ********************************************************-->
    <condition id="A33G52x CMSIS">
      <description>A33G524, A33G526, A33G527 device and CMSIS-Core</description>
      <require Tcompiler="ARMCC" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A33G527" />
      <accept Dvendor="ABOV Semiconductor:126" Dname="A33G526" />
	  <accept Dvendor="ABOV Semiconductor:126" Dname="A33G524" />
    </condition>
  </conditions>
  <components>
    <!-- component : A33G527/526/524 *************************************************************-->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>System Startup for ABOV A33G52x devices</description>
      <files>
        <file category="include" name="A33G52x\Core\include\" />
        <file category="include" name="A33G52x\Drivers\include\" />
        <file category="header" version="1.0.0" name="A33G52x\Core\include\A33G52x.h" attr="config" />
        <file category="source" version="1.0.0" name="A33G52x\Core\source\ARM\startup_A33G52x.s" attr="config" />
        <file category="header" version="1.0.0" name="A33G52x\Core\include\system_A33G52x.h" attr="config" />
        <file category="source" version="1.0.0" name="A33G52x\Core\source\system_A33G52x.c" attr="config" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="Debug_frameWork" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x debug framework</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\slib.h" />
        <file category="header" name="A33G52x\Drivers\include\console.h" />
        <file category="source" name="A33G52x\Drivers\source\slib.c" />
        <file category="source" name="A33G52x\Drivers\source\console.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="ADC" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x ADC control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_adc.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_adc.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FMC" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x Flash Memory Controller</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_flash.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_flash.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="FRT" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x 32-bit Free-Run Timer control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_frt.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_frt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="GPIO" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x GPIO control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_gpio.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_gpio.c" />
      </files>
    </component>
