XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A33G52x_Series.pdsc
    <component Cclass="Device" Cgroup="Drivers" Csub="I2C" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x I2C control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_i2c.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_i2c.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PCU" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x Port Map controller</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_pcu.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_pcu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PMU" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x Power Management Unit</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_pmu.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_pmu.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="PWM" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x PWM control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_pwm.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_pwm.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="SPI" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x SPI control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_spi.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_spi.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="TIMER" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x Timer control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_timer.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_timer.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="UART" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x UART control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_uart.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_uart.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="WDT" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x WDT control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_wdt.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_wdt.c" />
      </files>
    </component>
    <component Cclass="Device" Cgroup="Drivers" Csub="NVIC" Cversion="1.0.0" condition="A33G52x CMSIS">
      <description>A33G52x NVIC Control</description>
      <files>
        <file category="header" name="A33G52x\Drivers\include\a33g52x_nvic.h" />
        <file category="source" name="A33G52x\Drivers\source\a33g52x_nvic.c" />
      </files>
    </component>
  </components>
  <boards>
    <!-- component : A33G52x *************************************************************-->
    <board vendor="ABOV" name="StarterKit-A33G527VQN" revision="V1.1">
      <description>StarterKit-A33G527VQN</description>
	  <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A33G527" />
      <compatibleDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A33G524" />
      <feature type="XTAL" n="8000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-switch: User and nReset" />
      <feature type="LED" n="6" name="LEDs: 6 for user port" />
      <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
    <board vendor="ABOV" name="StarterKit-A33G526RLN" revision="V1.1">
      <description>StarterKit-A33G526RLN</description>
	  <mountedDevice deviceIndex="0" Dvendor="ABOV Semiconductor:126" Dname="A33G526" />
      <feature type="XTAL" n="8000000" />
      <feature type="PWR" n="5" name="USB Powered" />
      <feature type="PWR" n="3" m="5" name="External Supply" />
      <feature type="Button" n="2" name="Tact-switch: User and nReset" />
      <feature type="LED" n="6" name="LEDs: 6 for user port" />
      <debugInterface adapter="A-Link (CMSIS-DAP)" connector="USB Mini 5 pin"/>
    </board>
  </boards>
  <examples>
    <!-- example : A33G527 **********************************************************-->
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="A33G52x\Examples\StarterKit\GPIO_LedBlinky_Test">
      <description>Starter Kit - Gpio_LedBlinky (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_LedBlinky_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Test" doc="Abstract.txt" folder="A33G52x\Examples\ADC\ADC_Test">
      <description>ADC Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SYSTICK TEST" doc="Abstract.txt" folder="A33G52x\Examples\Cortex-M3\SysTick">
      <description>Systick example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Systick.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CODE/DATA FLASH TEST" doc="Abstract.txt" folder="A33G52x\Examples\FLASH\Flash_Test">
      <description>Code/Data Flash Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Flash_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FRT TEST" doc="Abstract.txt" folder="A33G52x\Examples\FRT\FRT_Test">
      <description>FRT Periodic and Free-run Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FRT_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Test" doc="Abstract.txt" folder="A33G52x\Examples\GPIO\GPIO_Test">
      <description>GPIO Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C TEST" doc="Abstract.txt" folder="A33G52x\Examples\I2C\I2C_Test">
      <description>I2C Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2C_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CLOCK MONITORING TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\CLKMonitor_Test">
      <description>PMU - Clock Monitoring Test (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CLKMonitor_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LVI TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\LVI_Test">
      <description>PMU - Low-Voltage Interrupt Test (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVI_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LVR TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\LVR_Test">
      <description>PMU - Low-Voltage Reset Test (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVR_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV MODE TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\MODE_Test">
      <description>PMU - Operating Mode Test (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\MODE_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PLL TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\PLL_Test">
      <description>PMU - PLL Setting Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PLL_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WAKE-UP TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\Wakeup_Test">
      <description>PMU - Wakeup Test Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Wakeup_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWM TEST" doc="Abstract.txt" folder="A33G52x\Examples\PWM\PWM_Test">
      <description>PMU - PLL Setting Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWM_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI TEST" doc="Abstract.txt" folder="A33G52x\Examples\SPI\SPI_Test">
      <description>SPI Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI EEPROM TEST" doc="Abstract.txt" folder="A33G52x\Examples\SPI\SPI_Test_EEPROM">
      <description>SPI EEPROM Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Test_EEPROM.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Polling TEST" doc="Abstract.txt" folder="A33G52x\Examples\SPI\SPI_Test_Polling">
      <description>SPI Polling Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Test_Polling.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Interrupt TEST" doc="Abstract.txt" folder="A33G52x\Examples\SPI\SPI_Test_Interrupt">
      <description>SPI Interrupt Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Test_Interrupt.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI Interrupt2 TEST" doc="Abstract.txt" folder="A33G52x\Examples\SPI\SPI_Test_Interrupt2">
      <description>SPI Interrupt Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Test_Interrupt2.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SRAM TEST" doc="Abstract.txt" folder="A33G52x\Examples\SRAM\SRAM_Test">
      <description>SRAM Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SRAM_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER TEST" doc="Abstract.txt" folder="A33G52x\Examples\TIMER\TIMER_Test">
      <description>Timer Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART TEST" doc="Abstract.txt" folder="A33G52x\Examples\UART\UART_HelloWorld">
      <description>UART Hello World example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\UART_HelloWorld.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT TEST" doc="Abstract.txt" folder="A33G52x\Examples\WDT\WDT_Test">
      <description>WDT Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G527VQN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
     <!-- example : A33G526 **********************************************************-->
    <example name="Starter Kit - Gpio_LedBlinky" doc="Abstract.txt" folder="A33G52x\Examples\StarterKit\GPIO_LedBlinky_Test">
      <description>Starter Kit - Gpio_LedBlinky (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_LedBlinky_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV ADC Test" doc="Abstract.txt" folder="A33G52x\Examples\ADC\ADC_Test">
      <description>ADC Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\ADC_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SYSTICK TEST" doc="Abstract.txt" folder="A33G52x\Examples\Cortex-M3\SysTick">
      <description>Systick example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Systick.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CODE/DATA FLASH TEST" doc="Abstract.txt" folder="A33G52x\Examples\FLASH\Flash_Test">
      <description>Code/Data Flash Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Flash_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV FRT TEST" doc="Abstract.txt" folder="A33G52x\Examples\FRT\FRT_Test">
      <description>FRT Periodic and Free-run Test example  (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\FRT_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV GPIO Test" doc="Abstract.txt" folder="A33G52x\Examples\GPIO\GPIO_Test">
      <description>GPIO Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\GPIO_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV I2C TEST" doc="Abstract.txt" folder="A33G52x\Examples\I2C\I2C_Test">
      <description>I2C Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\I2C_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV CLOCK MONITORING TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\CLKMonitor_Test">
      <description>PMU - Clock Monitoring Test  (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\CLKMonitor_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LVI TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\LVI_Test">
      <description>PMU - Low-Voltage Interrupt Test  (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVI_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV LVR TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\LVR_Test">
      <description>PMU - Low-Voltage Reset Test (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\LVR_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV MODE TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\MODE_Test">
      <description>PMU - Operating Mode Test (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\MODE_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PLL TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\PLL_Test">
      <description>PMU - PLL Setting Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PLL_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WAKE-UP TEST" doc="Abstract.txt" folder="A33G52x\Examples\PMU\Wakeup_Test">
      <description>PMU - Wakeup Test Test example (A33G527/526/524)</description>
