XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/ABOV.A33G52x_Series.pdsc
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\Wakeup_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV PWM TEST" doc="Abstract.txt" folder="A33G52x\Examples\PWM\PWM_Test">
      <description>PMU - PLL Setting Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\PWM_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SPI TEST" doc="Abstract.txt" folder="A33G52x\Examples\SPI\SPI_Test">
      <description>SPI Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SPI_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV SRAM TEST" doc="Abstract.txt" folder="A33G52x\Examples\SRAM\SRAM_Test">
      <description>SRAM Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\SRAM_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV TIMER TEST" doc="Abstract.txt" folder="A33G52x\Examples\TIMER\TIMER_Test">
      <description>Timer Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\TIMER_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV UART TEST" doc="Abstract.txt" folder="A33G52x\Examples\UART\UART_HelloWorld">
      <description>UART Hello World example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\UART_HelloWorld.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
    <example name="ABOV WDT TEST" doc="Abstract.txt" folder="A33G52x\Examples\WDT\WDT_Test">
      <description>WDT Test example (A33G527/526/524)</description>
      <board name="StarterKit-A33G526RLN" vendor="ABOV" />
      <project>
        <environment name="uv" load="Keil\WDT_Test.uvprojx" />
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE" />
        <component Cclass="Device" Cgroup="Startup" />
        <category>Getting Started</category>
      </attributes>
    </example>
  </examples>
</package>
